base/Documents/бит_кзн_ПланируемоеПоступлениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_кзн_ПланируемоеПоступлениеДенежныхСредств</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УдалитьХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКурсДокумента</Name>
					<Comment>Курс документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежаУпр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_кзн_ВидыПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_ДополнительныеУсловияПоДоговору</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ПланируемоеПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуКлиенту</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланированиеСуммы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПланированияОплатыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленНаСогласование</Name>
					<Comment>Признак того, что работа с документом завершена и он отправлен на согласование. Используется только в режиме "Проводить документы после утверждения".</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/InformationRegisters/бит_ДанныеДокументовКазначейства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ДанныеДокументовКазначейства</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_4</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_5</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_6</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_7</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_8</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_9</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_10</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_11</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_12</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКредитовИДепозитов</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыАренды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоХраненияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ПланируемоеПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаРасходованиеСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/InformationRegisters/бит_СтатусыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_СтатусыОбъектов</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПредыдущий</Name>
					<Comment>Статус предыдущий</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИзмененияСтатуса</Name>
					<Comment>Дата изменения статуса</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АлгоритмыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_ОбъектыСоСтатусами</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСтатуса</Name>
					<Comment>Вид статуса</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыСтатусовОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/Enums/бит_кзн_ВидыПланов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_кзн_ВидыПланов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прогноз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>План</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_ВидыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыДенежныхСредств</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
					<Comment>Наличные</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
					<Comment>Безналичные</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_РежимыЗаписиДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_РежимыЗаписиДокумента</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запись</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проведение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_ВидыСтатусовОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыСтатусовОбъектов</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СостояниеОплаты</Name>
					<Comment>Состояние оплаты</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Documents/бит_кзн_ПланируемоеПоступлениеДенежныхСредств/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВариантыОтчетов
// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	ИнтеграцияИСПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.бит_ПлатежныеДокументы) Тогда
        Команда = КомандыОтчетов.Добавить();
        Команда.Представление      = НСтр("ru = 'Документы оплаты'");
        Команда.МножественныйВыбор = Истина;
        Команда.ИмяПараметраФормы  = "Отбор.ДокументПланирования";
        Команда.КлючВарианта       = "ПлатежныеДокументы";
        Команда.Менеджер           = "Отчет.бит_ПлатежныеДокументы";
	КонецЕсли;

КонецПроцедуры
// Конец СтандартныеПодсистемы.ВариантыОтчетов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
		
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#Область ОбновлениеИнформационнойБазы

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьКОбработкеДокументыБезПланированияСуммы(Параметры) Экспорт

	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = ПустаяСсылка().Метаданные().ПолноеИмя();
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Дата УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Дата УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Дата КАК Дата
	|ИЗ
	|	Документ.бит_кзн_ПланируемоеПоступлениеДенежныхСредств КАК Реквизиты
	|ГДЕ
	|	Реквизиты.ПланированиеСуммы = ЗНАЧЕНИЕ(Перечисление.СпособыПланированияОплатыЗаявок.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));	

КонецПроцедуры

// Обработчик обновления.
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ОбработатьДокументыБезПланированияСуммыОтложенно(Параметры) Экспорт
	
	МетаданныеОбъекта = ПустаяСсылка().Метаданные();
	ПолноеИмяОбъекта  = МетаданныеОбъекта.ПолноеИмя();
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Если НЕ ЗначениеЗаполнено(ОбновляемыеДанные) Тогда
		Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
											Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
	КонецЕсли;
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылки", ОбновляемыеДанные.ВыгрузитьКолонку("Ссылка"));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(Позиции.Ссылка) КАК Позиция,
	|	Позиции.ДокументПланирования КАК ДокументПланирования
	|ПОМЕСТИТЬ ВТ_Позиции
	|ИЗ
	|	Документ.бит_кзн_ПозицияПоступления КАК Позиции
	|ГДЕ
	|	Позиции.ДокументПланирования В(&Ссылки)
	|
	|СГРУППИРОВАТЬ ПО
	|	Позиции.ДокументПланирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыПланирования.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(Позиции.Позиция.ПланированиеСуммы, ЗНАЧЕНИЕ(Перечисление.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа)) КАК ПланированиеСуммы
	|ИЗ
	|	Документ.бит_кзн_ПланируемоеПоступлениеДенежныхСредств КАК ДокументыПланирования
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Позиции КАК Позиции
	|		ПО ДокументыПланирования.Ссылка = Позиции.ДокументПланирования
	|ГДЕ
	|	ДокументыПланирования.Ссылка В(&Ссылки)
	|	И ЕСТЬNULL(Позиции.Позиция.ПланированиеСуммы, ЗНАЧЕНИЕ(Перечисление.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа)) <> ЗНАЧЕНИЕ(Перечисление.СпособыПланированияОплатыЗаявок.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка 		 = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокументОбъект.ПланированиеСуммы = Выборка.ПланированиеСуммы;
		
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			бит_ОбновлениеИнформационнойБазыБФ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Выборка.Ссылка);
		КонецПопытки;		
	КонецЦикла;
	
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		ШаблонСообщения = НСтр("ru = 'Не удалось обработать некоторые документы ""Планируемое поступление денежных средств (БИТ)"" (пропущены): %1'; 
								|en = 'Some documents ""Planned income"" could not be processed (skipped): %1'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ПроблемныхОбъектов);
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация, МетаданныеОбъекта,, ТекстСообщения);
	Иначе
		ШаблонСообщения = НСтр("ru = 'Обработана очередная порция документов ""Планируемое поступление денежных средств (БИТ)"": %1';
								|en = 'The next batch of documents ""Planned income"" has been processed: %1'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбъектовОбработано);
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация,
			МетаданныеОбъекта,, ТекстСообщения);
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
		Параметры.Очередь, ПолноеИмяОбъекта);

КонецПроцедуры

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьКОтражениюВДанныеДокументовКазначейства(Параметры) Экспорт

	РегистрыСведений.бит_ДанныеДокументовКазначейства.ЗарегистрироватьКОтражениюВДанныеДокументовКазначейства(Параметры, 
		Документы.бит_кзн_ПланируемоеПоступлениеДенежныхСредств);
	
КонецПроцедуры

// Обработчик обновления.
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ОбработатьОтражениеВДанныеДокументовКазначейства(Параметры) Экспорт

	РегистрыСведений.бит_ДанныеДокументовКазначейства.ОбработатьОтражениеВДанныеДокументовКазначейства(Параметры, 
		Документы.бит_кзн_ПланируемоеПоступлениеДенежныхСредств);	

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("ВидПлана");
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Данные.ВидПлана = Перечисления.бит_кзн_ВидыПланов.Прогноз  Тогда	
		СтандартнаяОбработка = Ложь;
		Представление = НСтр("ru='Прогноз поступления ДС %1 от %2';en='Prediction DS incoming %1 from %2'");
		Представление = СтрШаблон(Представление, Данные.Номер, Формат(Данные.Дата, "ДЛФ=DT"));	
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		
		Режим = "";
		Параметры.Свойство("Режим", Режим);
		
		Если НЕ Режим = "ОткрытиеСпискаПозиций" И Параметры.Свойство("Ключ") Тогда
			// Форма открывается по ссылке.
			РезультатПоиска = Документы.бит_кзн_ПозицияПоступления.НайтиПозициюПоОснованию(Параметры.Ключ);
			Позиция		    = РезультатПоиска.Позиция;
			Если РезультатПоиска.КоличествоПозиций = 1 Тогда
				Параметры.Ключ = Позиция;
				ВыбраннаяФорма = Метаданные.Документы.бит_кзн_ПозицияПоступления.ОсновнаяФормаОбъекта;
				СтандартнаяОбработка = Ложь;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ВводНаОсновании

// Подключаемый, см. бит_КазначействоВызовСервера.ПараметрыФормыВводНаОсновании().
//	
Функция ПараметрыФормыВводНаОсновании(Основание) Экспорт

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяФормы", "Документ.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.ФормаОбъекта");
	ПараметрыФормы.Вставить("ПараметрыФормы", Новый Структура);
	ПараметрыФормы.Вставить("Отказ", Ложь);

	ДанныеЗаполнения = Документы.бит_кзн_ПозицияПоступления.ДанныеЗаполненияИзОснования(Основание);
	
	Если ДанныеЗаполнения.Количество() = 0 Тогда 
		ТекстСообщения = НСтр("ru = 'Не требуется вводить планируемое поступление денежных средств на основании документа %1.';
								|en = 'It is not required to enter the planned receipt of funds based on the document %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Основание);
		ВызватьИсключение ТекстСообщения;
	ИначеЕсли ДанныеЗаполнения.Количество() = 1 Тогда
		// Ввод однострочного Планируемого поступления.
		// Открываем новую Позицию поступления. 
		ПараметрыФормы.ИмяФормы 	  = "Документ.бит_кзн_ПозицияПоступления.ФормаОбъекта";
		ПараметрыФормы.ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения[0]);
	Иначе
		// Записываем Позиции поступления, связывая с одним Планируемым поступлением.
		// Открываем Планируемое поступление.
		ДокументПланирования = ДокументПоДаннымПозицийПоступления(ДанныеЗаполнения);
		ПараметрыФормы.ИмяФормы 	  = "Документ.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.ФормаОбъекта";
		ПараметрыФормы.ПараметрыФормы = Новый Структура("Ключ", ДокументПланирования);
	КонецЕсли;
	
	Возврат ПараметрыФормы;

КонецФункции

// Добавляет команду создания документа "Заявка на расходование денежных средств (БИТ)".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.бит_кзн_ПозицияПоступления) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик	= "бит_КазначействоКлиент.СоздатьПланируемоеПоступлениеСредств";
		КомандаСоздатьНаОсновании.Идентификатор = "СоздатьПланируемоеПоступлениеСредств";
		КомандаСоздатьНаОсновании.Представление = НСтр("ru = 'Планируемое поступление ДС (БИТ)';
														|en = 'Planned cash receipt transaction'");
		КомандаСоздатьНаОсновании.РежимЗаписи 	= "Проводить";		
		Возврат КомандаСоздатьНаОсновании;		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ДокументПоДаннымПозицийПоступления(ДанныеЗаполнения) Экспорт
	
	Попытка
		НачатьТранзакцию();
		ДокументПланирования = Неопределено;
		Для каждого Элемент Из ДанныеЗаполнения Цикл
			Элемент.ДокументПланирования = ДокументПланирования;
			
			ПозицияОбъект = Документы.бит_кзн_ПозицияПоступления.СоздатьДокумент();
			ПозицияОбъект.Заполнить(Элемент);
			ПозицияОбъект.Записать(РежимЗаписиДокумента.Запись);
			Если ДокументПланирования = Неопределено Тогда
				ДокументПланирования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПозицияОбъект.Ссылка, "ДокументПланирования");
			КонецЕсли;
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат ДокументПланирования;

КонецФункции

#КонецОбласти

Функция СоздатьДокументыНаОсновеЗаявки(ДокументОснование) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументПланирования", ДокументОснование);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПозицияПоступления.ДатаПлан КАК Дата,
	|	ВЫБОР
	|		КОГДА ПозицияПоступления.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.бит_ВидыДенежныхСредств.Безналичные)
	|			ТОГДА ПозицияПоступления.БанковскийСчет
	|		ИНАЧЕ ПозицияПоступления.Касса
	|	КОНЕЦ КАК БанковскийСчетКасса,
	|	ПозицияПоступления.БанковскийСчетПолучателя КАК БанковскийСчетПолучателя,
	|	ПозицияПоступления.Ссылка КАК Позиция,
	|	ПозицияПоступления.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТ_Позиции
	|ИЗ
	|	Документ.бит_кзн_ПозицияПоступления КАК ПозицияПоступления
	|ГДЕ
	|	ПозицияПоступления.ДокументПланирования = &ДокументПланирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОстаткиПланируемыхПоступлений.Позиция КАК Позиция,
	|	ОстаткиПланируемыхПоступлений.СуммаОстаток КАК Сумма
	|ПОМЕСТИТЬ ВТ_ОстаткиПланируемыхПоступлений
	|ИЗ
	|	РегистрНакопления.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.Остатки(
	|			,
	|			Позиция В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТ_Позиции.Позиция КАК Позиция
	|				ИЗ
	|					ВТ_Позиции КАК ВТ_Позиции)) КАК ОстаткиПланируемыхПоступлений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Позиции.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	ВТ_Позиции.БанковскийСчетПолучателя КАК БанковскийСчетПолучателя,
	|	ВТ_Позиции.Дата КАК Дата,
	|	ВТ_Позиции.Позиция КАК Позиция,
	|	ЕСТЬNULL(ВТ_ОстаткиПланируемыхПоступлений.Сумма, 0) КАК Сумма,
	|	ВТ_Позиции.Подразделение КАК Подразделение
	|ИЗ
	|	ВТ_Позиции КАК ВТ_Позиции
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиПланируемыхПоступлений КАК ВТ_ОстаткиПланируемыхПоступлений
	|		ПО ВТ_Позиции.Позиция = ВТ_ОстаткиПланируемыхПоступлений.Позиция
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	БанковскийСчетКасса,
	|	БанковскийСчетПолучателя,
	|	Подразделение";
				   
	Результат = Запрос.Выполнить();                             
	Выборка = Результат.Выбрать();
	
	ПараметрыДокументов = Новый Массив;

	Пока Выборка.СледующийПоЗначениюПоля("Дата") Цикл
		Пока Выборка.СледующийПоЗначениюПоля("БанковскийСчетКасса") Цикл
			Пока Выборка.СледующийПоЗначениюПоля("БанковскийСчетПолучателя") Цикл
				Пока Выборка.СледующийПоЗначениюПоля("Подразделение") Цикл
					ДанныеЗаполнения = НовыеПараметрыДокументаСоздатьПлатежныеДокументы();
					ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, Выборка);
					
					Пока Выборка.Следующий() Цикл
						Если Выборка.Сумма = 0 Тогда
							ТекстСообщения = НСтр("ru = 'Недостаточно запланированных средств по %1. Документ пропущен.'");
							ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.Позиция);
							ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Выборка.Позиция);
						Иначе	
							ЗаполнитьЗначенияСвойств(ДанныеЗаполнения.Позиции.Добавить(), Выборка)
						КонецЕсли;
					КонецЦикла;
					
					Если ЗначениеЗаполнено(ДанныеЗаполнения.Позиции) Тогда
						ПараметрыДокументов.Добавить(ДанныеЗаполнения);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	НовыеДокументы = Новый ТаблицаЗначений;
	Если ЗначениеЗаполнено(ПараметрыДокументов) Тогда
		НовыеДокументы = СоздатьДокументыПоступления(ДокументОснование, ПараметрыДокументов);
	КонецЕсли;
	
	Возврат НовыеДокументы;
	
КонецФункции

// Функция создает документы поступления на основе списка выделенных документов.
//
Функция СоздатьДокументыНаОсновеВыделенных(ДокументОснование, ПараметрыВыделенных) Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВыделенныеСтроки", ПараметрыВыделенных.Позиции);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыделенныеСтроки.Позиция КАК Позиция,
	|	ВыделенныеСтроки.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВыделенныеСтроки
	|ИЗ
	|	&ВыделенныеСтроки КАК ВыделенныеСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОстаткиПланируемыхПоступлений.Позиция КАК Позиция,
	|	ЕСТЬNULL(ОстаткиПланируемыхПоступлений.СуммаОстаток, 0) КАК Сумма
	|ПОМЕСТИТЬ ВТ_ОстаткиПланируемыхПоступлений
	|ИЗ
	|	РегистрНакопления.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.Остатки(
	|			,
	|			Позиция В
	|				(ВЫБРАТЬ
	|					ВыделенныеСтроки.Позиция КАК Позиция
	|				ИЗ
	|					ВыделенныеСтроки КАК ВыделенныеСтроки)) КАК ОстаткиПланируемыхПоступлений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыделенныеСтроки.Позиция КАК Позиция,
	|	ВЫБОР
	|		КОГДА ВыделенныеСтроки.Сумма = 0
	|			ТОГДА ЕСТЬNULL(ОстаткиПланируемыхПоступлений.Сумма, 0)
	|		ИНАЧЕ ВыделенныеСтроки.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ПозицииПоступления.ДатаПлан КАК Дата,
	|	ВЫБОР
	|		КОГДА ПозицииПоступления.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.бит_ВидыДенежныхСредств.Безналичные)
	|			ТОГДА ПозицииПоступления.БанковскийСчет
	|		ИНАЧЕ ПозицииПоступления.Касса
	|	КОНЕЦ КАК БанковскийСчетКасса,
	|	ПозицииПоступления.БанковскийСчетПолучателя КАК БанковскийСчетПолучателя,
	|	ПозицииПоступления.Подразделение КАК Подразделение
	|ИЗ
	|	ВыделенныеСтроки КАК ВыделенныеСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бит_кзн_ПозицияПоступления КАК ПозицииПоступления
	|		ПО ВыделенныеСтроки.Позиция = ПозицииПоступления.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиПланируемыхПоступлений КАК ОстаткиПланируемыхПоступлений
	|		ПО ВыделенныеСтроки.Позиция = ОстаткиПланируемыхПоступлений.Позиция
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	БанковскийСчетКасса,
	|	БанковскийСчетПолучателя,
	|	Подразделение";

	Результат = Запрос.Выполнить();                             
	Выборка = Результат.Выбрать();

	ПараметрыДокументов = Новый Массив;

	Пока Выборка.СледующийПоЗначениюПоля("Дата") Цикл
		Пока Выборка.СледующийПоЗначениюПоля("БанковскийСчетКасса") Цикл
			Пока Выборка.СледующийПоЗначениюПоля("БанковскийСчетПолучателя") Цикл
				Пока Выборка.СледующийПоЗначениюПоля("Подразделение") Цикл
					ДанныеЗаполнения = НовыеПараметрыДокументаСоздатьПлатежныеДокументы();
					ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, ПараметрыВыделенных,, "Позиции");
					ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, Выборка,, "Дата");
					Если НЕ ЗначениеЗаполнено(ПараметрыВыделенных.Дата) Тогда
						ДанныеЗаполнения.Дата = Выборка.Дата;					
					КонецЕсли;
					
	 				Пока Выборка.Следующий() Цикл
						Если Выборка.Сумма = 0 Тогда
							ТекстСообщения = НСтр("ru = 'Недостаточно запланированных средств по %1. Документ пропущен.'");
							ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.Позиция);
							ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Выборка.Позиция);
						Иначе	
							ЗаполнитьЗначенияСвойств(ДанныеЗаполнения.Позиции.Добавить(), Выборка)
						КонецЕсли;
					КонецЦикла;
					Если ЗначениеЗаполнено(ДанныеЗаполнения.Позиции) Тогда
						ПараметрыДокументов.Добавить(ДанныеЗаполнения);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	НовыеДокументы = Новый ТаблицаЗначений;
	НовыеДокументы.Колонки.Добавить("ДокументОплаты");
	НовыеДокументы.Колонки.Добавить("Позиция");
	
	Если ЗначениеЗаполнено(ПараметрыДокументов) Тогда
		НовыеДокументы = СоздатьДокументыПоступления(ДокументОснование, ПараметрыДокументов);
	КонецЕсли;
	
	Возврат НовыеДокументы;
	
КонецФункции

Функция НовыеПараметрыДокументаСоздатьПлатежныеДокументы() Экспорт

	Позиции = Новый ТаблицаЗначений;
	Позиции.Колонки.Добавить("Позиция", 			Новый ОписаниеТипов("ДокументСсылка.бит_кзн_ПозицияПоступления"));
	Позиции.Колонки.Добавить("Сумма",				ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	Позиции.Колонки.Добавить("ИдентификаторСтроки", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	
	НовыеПараметры = Новый Структура;
	НовыеПараметры.Вставить("Дата", '0001-01-01');
	НовыеПараметры.Вставить("БанковскийСчетКасса", Неопределено);
	НовыеПараметры.Вставить("БанковскийСчетПолучателя", Неопределено);
	НовыеПараметры.Вставить("Позиции", Позиции);

	НовыеПараметры.Вставить("ОбъединятьНазначениеПлатежа", Истина);
	НовыеПараметры.Вставить("РежимЗаписи", 				   Перечисления.бит_РежимыЗаписиДокумента.Запись);

	Возврат НовыеПараметры;

КонецФункции

// Функция создает документы поступления денежных средств.
//
// Параметры:
//  ДокументОснование - ДокументСсылка.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.
//
Функция СоздатьДокументыПоступления(ДокументОснование, ПараметрыДокументов) Экспорт 

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ДокументОплаты");
	Результат.Колонки.Добавить("Позиция");
	
	Если НЕ ЗначениеЗаполнено(ПараметрыДокументов) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ФормаОплаты КАК ФормаОплаты,
	|	Реквизиты.Контрагент КАК Контрагент
	|ИЗ
	|	Документ.бит_кзн_ПланируемоеПоступлениеДенежныхСредств КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	РезультатЗапроса   = Запрос.Выполнить().Выгрузить();
	РеквизитыОснования = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса[0]);
	
	ВидОперацииБФ = Перечисления.бит_ВидыОперацийКазначейства.ПоступлениеОплатыОтКлиента; 
	ВидОперации   = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента;
	РеквизитыОснования.Вставить("ХозяйственнаяОперация", ВидОперацииБФ);

	ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();

	// определим фактическией сценарий
	ПараметрыНастроек  = Новый Структура("Организация", РеквизитыОснования.Организация);
    СценарийФакт 	   = бит_НастройкиПрограммы.СценарийОтраженияФактаБДДС(ПараметрыНастроек, ТекущаяДатаСеанса());	
							
    Если НЕ ЗначениеЗаполнено(СценарийФакт) Тогда
		СценарийФакт = Справочники.СценарииПланирования.ФАКТ;
	КонецЕсли; 
	
	Если РеквизитыОснования.ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные Тогда
		МенеджерПлатежногоДокумента   = Документы.ПоступлениеБезналичныхДенежныхСредств;
		МетаданныеПлатежногоДокумента = Метаданные.Документы.ПоступлениеБезналичныхДенежныхСредств;
		Безналичные 		  		  = Истина;
	ИначеЕсли РеквизитыОснования.ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Наличные Тогда
		МенеджерПлатежногоДокумента   = Документы.ПриходныйКассовыйОрдер;
		МетаданныеПлатежногоДокумента = Метаданные.Документы.ПриходныйКассовыйОрдер;
		Безналичные 				  = Ложь;
	КонецЕсли;

	ЕстьРасшифровкаПлатежа	   = НЕ бит_КазначействоКлиентСервер.ЭтоОперацияБезРасшифровкиПлатежа(ВидОперацииБФ);
	ЕстьПодразделение		   = ОбщегоНазначения.ЕстьРеквизитОбъекта("Подразделение", МетаданныеПлатежногоДокумента);
	ЕстьТипПлатежногоДокумента = ОбщегоНазначения.ЕстьРеквизитОбъекта("ТипПлатежногоДокумента", МетаданныеПлатежногоДокумента);
	ЕстьНазначениеПлатежа	   = ОбщегоНазначения.ЕстьРеквизитОбъекта("НазначениеПлатежа", МетаданныеПлатежногоДокумента);

	Для каждого ТекущиеПараметры Из ПараметрыДокументов Цикл
		
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("СуммыКОплате", 				ТекущиеПараметры);
		ПараметрыЗаполнения.Вставить("Безналичные", 				Безналичные);
		ПараметрыЗаполнения.Вставить("ВидОперации", 				ВидОперации);
		ПараметрыЗаполнения.Вставить("ЕстьНазначениеПлатежа", 		ЕстьНазначениеПлатежа);
		ПараметрыЗаполнения.Вставить("ЕстьПодразделение", 			ЕстьПодразделение);
		ПараметрыЗаполнения.Вставить("ЕстьТипПлатежногоДокумента", 	ЕстьТипПлатежногоДокумента);
		ПараметрыЗаполнения.Вставить("МенеджерПлатежногоДокумента", МенеджерПлатежногоДокумента);
		ПараметрыЗаполнения.Вставить("ОбъединятьНазначениеПлатежа", ТекущиеПараметры.ОбъединятьНазначениеПлатежа);
		ПараметрыЗаполнения.Вставить("РеквизитыОснования", 			РеквизитыОснования);
		ПараметрыЗаполнения.Вставить("СценарийФакт", 				СценарийФакт);
		ПараметрыЗаполнения.Вставить("ВалютаРеглУчета", 			ВалютаРеглУчета);
		ПараметрыЗаполнения.Вставить("ЕстьРасшифровкаПлатежа", 		ЕстьРасшифровкаПлатежа);
		ПараметрыЗаполнения.Вставить("РежимЗаписиПлатДокумента", 	ТекущиеПараметры.РежимЗаписи);
		ПараметрыЗаполнения.Вставить("ДатаДокумента", 				'0001-01-01');
		
		ДокументПозиция = ТекущиеПараметры.Позиции[0].Позиция;
		
		ЗначениеРеквизитовПозиции = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументПозиция, "ДатаПлан");
		
		Если НЕ ЗначениеЗаполнено(ТекущиеПараметры.Дата) Тогда
			ПараметрыЗаполнения.ДатаДокумента = ЗначениеРеквизитовПозиции.ДатаПлан;
		Иначе			
			ПараметрыЗаполнения.ДатаДокумента = ТекущиеПараметры.Дата;
		КонецЕсли;

		СоздатьДокументПоступления(ПараметрыЗаполнения, Результат);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция РазбитьПозицию(Позиция, СуммаНач, СуммаНов, ДатаПлатежа) Экспорт 
	
	ВыводСообщений	   = "Ошибки";
	РазбиениеВыполнено = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Позиция", Позиция);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СтатусыОбъектов.Объект,
	|	бит_СтатусыОбъектов.Статус,
	|	бит_СтатусыОбъектов.Пользователь,
	|	бит_СтатусыОбъектов.ДатаИзмененияСтатуса,
	|	бит_СтатусыОбъектов.СтатусПредыдущий
	|ИЗ
	|	РегистрСведений.бит_СтатусыОбъектов КАК бит_СтатусыОбъектов
	|ГДЕ
	|	бит_СтатусыОбъектов.Объект = &Позиция
	|	И бит_СтатусыОбъектов.ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.бит_ВидыСтатусовОбъектов.Статус)";
	
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Статус		 		 = Выборка.Статус;
		ПредыдущийСтатус	 = Выборка.СтатусПредыдущий;
		Пользователь 		 = Выборка.Пользователь;
	    ДатаИзмененияСтатуса = Выборка.ДатаИзмененияСтатуса;
		
	КонецЦикла;
	
	ДанныеСообщения = Неопределено;
	
	НачатьТранзакцию();
	Попытка	
		//Получаем текущую позицию и меняем в ней сумму на разницу между начальной суммой и новой
		Объект = Позиция.ПолучитьОбъект();
		
		РежимЗаписи = ?(Объект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
		
		Объект.СуммаДокумента = СуммаНач - СуммаНов;
		Если Объект.ВалютаВзаиморасчетов <> Объект.ВалютаДокумента Тогда
			Объект.СуммаВзаиморасчетов = 0;
		Иначе
			Объект.СуммаВзаиморасчетов = Объект.СуммаДокумента;
		КонецЕсли;

		Если Объект.ВалютаДокумента = Объект.ВалютаВзаиморасчетов Тогда
			Объект.СуммаВзаиморасчетов = Объект.СуммаДокумента;
		Иначе
			Данные = Новый Структура;
			Данные.Вставить("Сумма", 						 Объект.СуммаДокумента);
			Данные.Вставить("КурсЧислительВзаиморасчетов",	 Объект.КурсЧислительВзаиморасчетов);
			Данные.Вставить("КурсЗнаменательВзаиморасчетов", Объект.КурсЗнаменательВзаиморасчетов);
			Данные.Вставить("СуммаВзаиморасчетов",			 Объект.СуммаВзаиморасчетов);
			
			ДенежныеСредстваКлиентСервер.РассчитатьСуммуВзаиморасчетовВСтрокеРасшифровки(
				Данные, Объект.ВалютаДокумента, Константы.ВалютаРегламентированногоУчета.Получить());
			
			Объект.СуммаВзаиморасчетов = Данные.СуммаВзаиморасчетов; 		
		КонецЕсли;
		
		Объект.СуммаНДС = РасчитатьСуммуНДС(Объект.СуммаДокумента, Объект.СтавкаНДС);
		
		Попытка
			Объект.Записать(РежимЗаписи);		
		Исключение
			ТекстСообщения  = НСтр("ru = 'Не удалось записать документ %1. По причине: %2.'");
			ТекстСообщения  = СтрШаблон(ТекстСообщения, Позиция, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ДанныеСообщения = Позиция;
			
			ВызватьИсключение ТекстСообщения;
		КонецПопытки;	
		
		НоваяПозиция = Позиция.Скопировать();
		НоваяПозиция.ДополнительныеСвойства.Вставить("НеСинхронизировать", Истина);

		НоваяПозиция.Дата			= Позиция.Дата;
		
		Если НЕ ЗначениеЗаполнено(ДатаПлатежа) Тогда
			НоваяПозиция.ДатаПлан		 = Позиция.ДатаПлан;
			НоваяПозиция.ДатаПланКрайняя = Позиция.ДатаПланКрайняя;
		Иначе 
			НоваяПозиция.ДатаПлан = ДатаПлатежа;
		КонецЕсли; 	
		
		НоваяПозиция.СуммаДокумента = СуммаНов;
		
		Если НоваяПозиция.ВалютаДокумента = НоваяПозиция.ВалютаВзаиморасчетов Тогда
			НоваяПозиция.СуммаВзаиморасчетов = НоваяПозиция.СуммаДокумента;
		Иначе
			Данные = Новый Структура;
			Данные.Вставить("Сумма", 						 НоваяПозиция.СуммаДокумента);
			Данные.Вставить("КурсЧислительВзаиморасчетов",	 НоваяПозиция.КурсЧислительВзаиморасчетов);
			Данные.Вставить("КурсЗнаменательВзаиморасчетов", НоваяПозиция.КурсЗнаменательВзаиморасчетов);
			Данные.Вставить("СуммаВзаиморасчетов",			 НоваяПозиция.СуммаВзаиморасчетов);
			
			ДенежныеСредстваКлиентСервер.РассчитатьСуммуВзаиморасчетовВСтрокеРасшифровки(
				Данные, НоваяПозиция.ВалютаДокумента, Константы.ВалютаРегламентированногоУчета.Получить());
			
			НоваяПозиция.СуммаВзаиморасчетов = НоваяПозиция.СуммаВзаиморасчетов; 		
		КонецЕсли;
			
		НоваяПозиция.СуммаНДС = РасчитатьСуммуНДС(НоваяПозиция.СуммаДокумента, НоваяПозиция.СтавкаНДС);
		
		НоваяПозиция.Записать(РежимЗаписиДокумента.Запись);
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Попытка
				НоваяПозиция.Записать(РежимЗаписиДокумента.Проведение);
				
				ПараметрыУстановкиСтатуса = бит_ВизированиеСервер.НовыеПараметрыУстановкиСтатуса();
				ПараметрыУстановкиСтатуса.Объект               = НоваяПозиция.Ссылка; 
				ПараметрыУстановкиСтатуса.Статус               = Статус;
				ПараметрыУстановкиСтатуса.СтатусПредыдущий     = ПредыдущийСтатус;
				ПараметрыУстановкиСтатуса.ДатаИзмененияСтатуса = ДатаИзмененияСтатуса;
				ПараметрыУстановкиСтатуса.Пользователь         = Пользователь;
			
				ДействиеВыполнено = бит_ВизированиеСервер.УстановитьСтатусОбъекта(ПараметрыУстановкиСтатуса);

			Исключение
				ТекстСообщения  = НСтр("ru = 'Не удалось провести документ %1. По причине: %2.'");
				ТекстСообщения  = СтрШаблон(ТекстСообщения, НоваяПозиция.Ссылка, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				ДанныеСообщения = НоваяПозиция.Ссылка;
				
				ВызватьИсключение ТекстСообщения;
			КонецПопытки;
		КонецЕсли;
				
		РазбиениеВыполнено = Истина;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДанныеСообщения, "Ссылка");
	КонецПопытки;	
	
	Возврат РазбиениеВыполнено;
	
КонецФункции

Процедура СоздатьДокументПоступления(ПараметрыЗаполнения, Результат)

	Безналичные 				= ПараметрыЗаполнения.Безналичные;
	ВидОперации 				= ПараметрыЗаполнения.ВидОперации;
	ЕстьНазначениеПлатежа 		= ПараметрыЗаполнения.ЕстьНазначениеПлатежа;
	ЕстьПодразделение 			= ПараметрыЗаполнения.ЕстьПодразделение;
	ЕстьТипПлатежногоДокумента	= ПараметрыЗаполнения.ЕстьТипПлатежногоДокумента;
	МенеджерПлатежногоДокумента = ПараметрыЗаполнения.МенеджерПлатежногоДокумента;
	ОбъединятьНазначениеПлатежа = ПараметрыЗаполнения.ОбъединятьНазначениеПлатежа;
	РеквизитыОснования 			= ПараметрыЗаполнения.РеквизитыОснования;
	СценарийФакт 				= ПараметрыЗаполнения.СценарийФакт;
	ВалютаРеглУчета 			= ПараметрыЗаполнения.ВалютаРеглУчета;
	ЕстьРасшифровкаПлатежа 		= ПараметрыЗаполнения.ЕстьРасшифровкаПлатежа;
	ДатаДокумента               = ПараметрыЗаполнения.ДатаДокумента;
	РежимЗаписиПлатДокумента    = ПараметрыЗаполнения.РежимЗаписиПлатДокумента;
	СуммыКОплате               	= ПараметрыЗаполнения.СуммыКОплате;
	
	ВсеПозиции 		 = СуммыКОплате.Позиции.ВыгрузитьКолонку("Позиция");
	РеквизитыПозиций = Документы.бит_кзн_ПозицияПоступления.РеквизитыДокумента(ВсеПозиции);		
		
	РезультатФормирования = Новый Структура("ОткрытьФорму, Ссылка, Позиции");
	ТекущийОбъект = МенеджерПлатежногоДокумента.СоздатьДокумент();
	
	ТекущийОбъект.Дата					= ДатаДокумента;
	ТекущийОбъект.ХозяйственнаяОперация = ВидОперации;
	
	Если Безналичные Тогда
		ТекущийОбъект.БанковскийСчет			= СуммыКОплате.БанковскийСчетКасса;
		ТекущийОбъект.БанковскийСчетКонтрагента = РеквизитыПозиций[0].БанковскийСчетПолучателя;	
	Иначе 
		ТекущийОбъект.Касса = СуммыКОплате.БанковскийСчетКасса;
	КонецЕсли; 
	
	Если ЕстьНазначениеПлатежа Тогда
		// ВАЖНО! "Назначение платежа" формируется окончательно перед записью документа.
		Если ОбъединятьНазначениеПлатежа Тогда
			НазначениеПлатежа = Новый Массив; 
			Для каждого Запись Из РеквизитыПозиций Цикл
				ТекстНазначение = Запись.НазначениеПлатежа;
				Если ПустаяСтрока(ТекстНазначение) И ЗначениеЗаполнено(ТекущийОбъект.БанковскийСчетКонтрагента) Тогда
					ТекстНазначение = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьРеквизитыБанковскогоСчета(
											ТекущийОбъект.БанковскийСчетКонтрагента).ТекстНазначения;
				КонецЕсли;
				Если ЗначениеЗаполнено(ТекстНазначение) Тогда
					ЧастиТекста = ЧастиТекстаНазначениеПлатежа(ТекстНазначение);
					НазначениеПлатежа.Добавить(ЧастиТекста.Назначение);
				КонецЕсли;
			КонецЦикла; 
			НазначениеПлатежа = ОбщегоНазначенияКлиентСервер.СвернутьМассив(НазначениеПлатежа);
			ТекущийОбъект.НазначениеПлатежа = СтрСоединить(НазначениеПлатежа, ", ");	
		Иначе
			ТекстНазначение = РеквизитыПозиций[0].НазначениеПлатежа;	
			Если ПустаяСтрока(ТекстНазначение) И ЗначениеЗаполнено(ТекущийОбъект.БанковскийСчетКонтрагента) Тогда
				ТекстНазначение = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьРеквизитыБанковскогоСчета(
				ТекущийОбъект.БанковскийСчетКонтрагента).ТекстНазначения;
			КонецЕсли;
			ЧастиТекста = ЧастиТекстаНазначениеПлатежа(ТекстНазначение);
			ТекущийОбъект.НазначениеПлатежа = ЧастиТекста.Назначение;
		КонецЕсли; 
	КонецЕсли; 
	
	РеквизитыПозиции = ЗначениеРеквизитовПозиции(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РеквизитыПозиций[0]));
	ОпределитьСтатьюДДС(ТекущийОбъект, РеквизитыПозиции, ВидОперации);
	
	ИспользоватьПодразделения = ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения");
	Если ЕстьПодразделение И ИспользоватьПодразделения Тогда
		ТекущийОбъект.Подразделение = РеквизитыПозиций[0].Подразделение;
	КонецЕсли;
	
	ТекущийОбъект.Организация = РеквизитыОснования.Организация;
	ТекущийОбъект.Контрагент  = РеквизитыОснования.Контрагент;
	
	Если ЕстьТипПлатежногоДокумента Тогда
		ТекущийОбъект.ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ПлатежноеПоручение;		
	КонецЕсли;
	
	//Шапку документа из первой позиции.
	ПлатежнаяПозиция = РеквизитыПозиций[0];
	
	ТекущийОбъект.Валюта = ПлатежнаяПозиция.ВалютаДенежныхСредств;
	
	Дополнительно = Новый Структура;
	Дополнительно.Вставить("ЕстьПодразделение", 		ЕстьПодразделение);
	Дополнительно.Вставить("ИспользоватьПодразделения", ИспользоватьПодразделения);
	Дополнительно.Вставить("ВалютаРеглУчета", 	 		ВалютаРеглУчета);
	
	ПодготовитьРасшифровкуПлатежа(РеквизитыПозиций, СуммыКОплате, ТекущийОбъект, Дополнительно);
	
	ТекущийОбъект.СуммаДокумента = ТекущийОбъект.РасшифровкаПлатежа.Итог("Сумма");
	
	ТекущийОбъект.СуммаДокумента = ТекущийОбъект.РасшифровкаПлатежа.Итог("Сумма");
	
	Если НЕ ЕстьРасшифровкаПлатежа Тогда
		ТекущийОбъект.РасшифровкаПлатежа.Очистить();
	КонецЕсли;
	
	Если ЕстьНазначениеПлатежа И ЕстьРасшифровкаПлатежа Тогда
		ТекстСумма 	  = СтрШаблон(НСтр("ru = 'Сумма %1'; en = 'Amount %1'") , 
		Формат(ТекущийОбъект.СуммаДокумента, "ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ="));
		ТекстСуммаНДС = ДенежныеСредстваСервер.ТекстСуммаНДСПлатежа(ТекущийОбъект.Организация, ТекущийОбъект.Валюта, ТекущийОбъект.РасшифровкаПлатежа, Истина);
		ТекущийОбъект.НазначениеПлатежа = ТекущийОбъект.НазначениеПлатежа + Символы.ПС + ТекстСумма + Символы.ПС + ТекстСуммаНДС;
	КонецЕсли; 
	
	// Если сумма по всем позициям этого документа нулевая то не открываем форму.
	РезультатФормирования.ОткрытьФорму = ТекущийОбъект.СуммаДокумента <> 0;
	
	РежимСообщений = "Ошибки";		
	
	Если ТекущийОбъект.СуммаДокумента = 0 Тогда
		Успешно = Ложь;
	Иначе	
		Успешно = бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ТекущийОбъект, РежимЗаписиДокумента.Запись,, РежимСообщений);		
	КонецЕсли;
	
	Если Успешно Тогда
		
		Документы.бит_ОтражениеФактаДДС.ЗаполнитьОтражениеФактаПоДокументамПланирования(ТекущийОбъект, СуммыКОплате.Позиции, СценарийФакт);
		
		Для каждого Позиция Из СуммыКОплате.Позиции Цикл
			НоваяСтрока = Результат.Добавить(); 			
			НоваяСтрока.Позиция = Позиция;
			НоваяСтрока.ДокументОплаты = ТекущийОбъект.Ссылка;
		КонецЦикла;
		
		Если РежимЗаписиПлатДокумента = РежимЗаписиДокумента.Проведение
			И бит_Казначейство.ПроверитьЗаполнениеПлатежногоДокумента(ТекущийОбъект, РежимЗаписиПлатДокумента, Ложь) Тогда 				
			бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ТекущийОбъект, РежимЗаписиДокумента.Проведение);			
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры

Процедура ПодготовитьРасшифровкуПлатежа(ДанныеПозиций, СуммыКОплате, ТекущийОбъект, Дополнительно)
	
	ЕстьПодразделение		  = Дополнительно.ЕстьПодразделение;
	ИспользоватьПодразделения = Дополнительно.ИспользоватьПодразделения;
	ВалютаРеглУчета			  = Дополнительно.ВалютаРеглУчета;

	ДатаДокумента = ТекущийОбъект.Дата;
	ВидОперации   = ТекущийОбъект.ХозяйственнаяОперация;
	
	РасшифровкаПлатежа = ТекущийОбъект.РасшифровкаПлатежа.Выгрузить();
	РасшифровкаПлатежа.Колонки.Добавить("Позиция");
	
	Для каждого ПлатежнаяПозиция Из ДанныеПозиций Цикл
		
		ОбъектРасчетов = ?(ЗначениеЗаполнено(ПлатежнаяПозиция.ОбъектРасчетов), ПлатежнаяПозиция.ОбъектРасчетов, ПлатежнаяПозиция.Договор);
		СуммаКОплате   = СуммыКОплате.Позиции.Найти(ПлатежнаяПозиция.Ссылка, "Позиция").Сумма;
		
		Если ПлатежнаяПозиция.ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа Тогда
			
			Коэффициенты = бит_Казначейство.ПолучитьКоэффициентыПересчетаВалюты(ПлатежнаяПозиция.ВалютаДокумента,
							ПлатежнаяПозиция.ВалютаВзаиморасчетов, ДатаДокумента, ПлатежнаяПозиция.Организация,,, ОбъектРасчетов);
			
			Сумма				= СуммаКОплате;
			СуммаВзаиморасчетов = Сумма * Коэффициенты.КоэффициентПересчетаВВалютуВзаиморасчетов;
			СуммаНДС			= ПлатежнаяПозиция.СуммаНДС;
		Иначе
			
			Коэффициенты = бит_Казначейство.ПолучитьКоэффициентыПересчетаВалюты(ПлатежнаяПозиция.ВалютаДокумента,
							ПлатежнаяПозиция.ВалютаДенежныхСредств, ДатаДокумента, ПлатежнаяПозиция.Организация,,, ОбъектРасчетов);
			
			СуммаВзаиморасчетов = СуммаКОплате;
			Сумма				= СуммаВзаиморасчетов * Коэффициенты.КоэффициентПересчетаВВалютуВзаиморасчетов;
			СуммаНДС			= РасчитатьСуммуНДС(Сумма, ПлатежнаяПозиция.СтавкаНДС);					
		КонецЕсли;
				
		НоваяСтрока = РасшифровкаПлатежа.Добавить();
		
		НоваяСтрока.ВалютаВзаиморасчетов 		  = ПлатежнаяПозиция.ВалютаВзаиморасчетов;
		НоваяСтрока.СуммаВзаиморасчетов  		  = СуммаВзаиморасчетов;
		НоваяСтрока.Сумма 						  = Сумма;
		
		НоваяСтрока.СтавкаНДС = ПлатежнаяПозиция.СтавкаНДС;
		НоваяСтрока.СуммаНДС  = СуммаНДС;
				
		РеквизитыПозиции = ЗначениеРеквизитовПозиции(ПлатежнаяПозиция.Ссылка);
		ОпределитьСтатьюДДС(НоваяСтрока, РеквизитыПозиции, ВидОперации);
		
		Если ЕстьПодразделение И ИспользоватьПодразделения Тогда
			НоваяСтрока.Подразделение = ПлатежнаяПозиция.Подразделение;
		КонецЕсли;
		
		НоваяСтрока.ДоговорКредитаДепозита	 = ПлатежнаяПозиция.ДоговорКредитаДепозита;
		// ++ NB  НоваяСтрока.ДоговорАренды 			 = ПлатежнаяПозиция.ДоговорАренды;
		НоваяСтрока.ОбъектРасчетов 			 = ПлатежнаяПозиция.ОбъектРасчетов;
		НоваяСтрока.ОснованиеПлатежа     	 = ПлатежнаяПозиция.ОснованиеПлатежа;
		НоваяСтрока.Организация				 = ПлатежнаяПозиция.Организация;
		НоваяСтрока.Партнер 				 = ДенежныеСредстваСервер.ПолучитьПартнераПоКонтрагенту(
													ПлатежнаяПозиция.Контрагент, ТекущийОбъект.ХозяйственнаяОперация);
															
		Если ЗначениеЗаполнено(НоваяСтрока.ДоговорАренды) Тогда
			РеквизитыДоговораАренды = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоваяСтрока.ДоговорАренды, 
										"СтатьяДвиженияДенежныхСредств");
			НоваяСтрока.СтатьяДвиженияДенежныхСредств = РеквизитыДоговораАренды.СтатьяДвиженияДенежныхСредств;
			НоваяСтрока.ТипПлатежаПоАренде			  = Перечисления.ТипыПлатежейПоАренде.УслугаПоАренде;
		КонецЕсли;
		
		КурсИКратность = ДенежныеСредстваСервер.КурсЧислительИКурсЗнаменательВзаиморасчетов(
							ТекущийОбъект.Валюта, НоваяСтрока.ВалютаВзаиморасчетов, ВалютаРеглУчета, 
							ТекущийОбъект.Дата, НоваяСтрока.ОбъектРасчетов, ПлатежнаяПозиция.Договор);
			
		НоваяСтрока.КурсЧислительВзаиморасчетов   = КурсИКратность.КурсЧислитель;
		НоваяСтрока.КурсЗнаменательВзаиморасчетов = КурсИКратность.КурсЗнаменатель;
		
		НоваяСтрока.Позиция = ПлатежнаяПозиция.Ссылка;
	КонецЦикла;

	КолонкиГруппировок = ГруппировкиДляРасшифровкиПлатежа();
	КолонкиРесурсов	   = "СуммаВзаиморасчетов, Сумма, СуммаНДС";
	
	ИтоговаяРасшифровкаПлатежа = РасшифровкаПлатежа.Скопировать();
	ИтоговаяРасшифровкаПлатежа.ЗаполнитьЗначения(0, "СуммаВзаиморасчетов");
	ИтоговаяРасшифровкаПлатежа.ЗаполнитьЗначения(0, "Сумма");
	ИтоговаяРасшифровкаПлатежа.ЗаполнитьЗначения(0, "СуммаНДС");
	
	ИтоговаяРасшифровкаПлатежа.Свернуть(СтрСоединить(КолонкиГруппировок, ",") + ", ИдентификаторСтроки", КолонкиРесурсов);
	
	Для каждого СтрокаТаблицы Из ИтоговаяРасшифровкаПлатежа Цикл
		
		ПараметрыПоиска = Новый Структура(СтрСоединить(КолонкиГруппировок, ","));
		ЗаполнитьЗначенияСвойств(ПараметрыПоиска, СтрокаТаблицы);
		РезультатПоиска  = РасшифровкаПлатежа.НайтиСтроки(ПараметрыПоиска);
		
		СвязанныеПозиции = Новый Массив;
		Для каждого Запись Из РезультатПоиска Цикл
			СтрокаТаблицы.СуммаВзаиморасчетов = СтрокаТаблицы.СуммаВзаиморасчетов + Запись.СуммаВзаиморасчетов;
			СтрокаТаблицы.Сумма				  = СтрокаТаблицы.Сумма + Запись.Сумма;
			СтрокаТаблицы.СуммаНДС			  = СтрокаТаблицы.СуммаНДС + Запись.СуммаНДС;
			СвязанныеПозиции.Добавить(Запись.Позиция);
		КонецЦикла;
		СтрокаТаблицы.ИдентификаторСтроки = Новый УникальныйИдентификатор();
		Для каждого Позиция Из СвязанныеПозиции Цикл
			РезультатПоискаПозиций = СуммыКОплате.Позиции.Найти(Позиция, "Позиция");
			РезультатПоискаПозиций.ИдентификаторСтроки = СтрокаТаблицы.ИдентификаторСтроки;
		КонецЦикла;
	КонецЦикла;
	
	ТекущийОбъект.РасшифровкаПлатежа.Загрузить(ИтоговаяРасшифровкаПлатежа);

КонецПроцедуры

Функция ГруппировкиДляРасшифровкиПлатежа()

	Группировки = Новый Массив;
	Группировки.Добавить("ВалютаВзаиморасчетов");
	Группировки.Добавить("СтавкаНДС");
	Группировки.Добавить("ДоговорЗаймаСотруднику");
	Группировки.Добавить("СтатьяДоходов");
	Группировки.Добавить("АналитикаДоходов");
	Группировки.Добавить("АналитикаАктивовПассивов");
	Группировки.Добавить("ОбъектРасчетов");
	Группировки.Добавить("Партнер");
	Группировки.Добавить("Подразделение");
	Группировки.Добавить("ТипСуммыКредитаДепозита");
	Группировки.Добавить("ДоговорАренды");
	Группировки.Добавить("ТипПлатежаПоАренде");
	
	Группировки.Добавить("СтатьяДвиженияДенежныхСредств");
	Группировки.Добавить("КурсЧислительВзаиморасчетов");
	Группировки.Добавить("КурсЗнаменательВзаиморасчетов");
	
	Возврат Группировки;
	
КонецФункции

// Функция получает плановую и фактическую сумму оплат по поступлению.
//
// Параметры:
//  Заявка			  - ДокументСсылка.бит_кзн_ПланируемоеПоступлениеДенежныхСредств, Массив.
//  ПлатежныйДокумент - Платежный документ ссылка. По умолчанию Неопределено.
//
// Возвращаемое значение:
//   РезСтруктура 
//		- 1. Структура 	- Заявка - ДокументСсылка.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.
// 		- 2. Соответствие - Заявка - Массив.
//
Функция ПолучитьОплатыПоПоступлению(Заявка, ПлатежныйДокумент = Неопределено) Экспорт

	УказанМассивЗаявок = ?(ТипЗнч(Заявка) = Тип("Массив"), Истина, Ложь);
	
	Если УказанМассивЗаявок Тогда
		МассивЗаявок = Заявка;
	Иначе
		
		МассивЗаявок = Новый Массив;
		МассивЗаявок.Добавить(Заявка);
		
	КонецЕсли;
	
	РезСтруктураШаблон = Новый Структура;
	РезСтруктураШаблон.Вставить("СуммаПлан"				, 0);
	РезСтруктураШаблон.Вставить("СуммаОплата"			, 0);
	РезСтруктураШаблон.Вставить("СуммаЗакрыта"			, 0);
	РезСтруктураШаблон.Вставить("Разность"				, 0);
	РезСтруктураШаблон.Вставить("СуммаДокументаПлан"	, 0);
	РезСтруктураШаблон.Вставить("СуммаДокументаОплата"	, 0);
	РезСтруктураШаблон.Вставить("СуммаДокументаЗакрыта"	, 0);
	РезСтруктураШаблон.Вставить("СуммаДокументаРазность", 0);
	
	СтрОплата = РезСтруктураШаблон;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЕСТЬNULL(ПлПоступлениеДенежныхСредств.СуммаКонечныйОстаток, 0) КАК СуммаОстаток,
	               |	ЕСТЬNULL(ПлПоступлениеДенежныхСредств.СуммаПриход, 0) КАК СуммаПлан,
	               |	ЕСТЬNULL(ПлПоступлениеДенежныхСредств.СуммаРасход, 0) КАК СуммаФакт
	               |ИЗ
	               |	РегистрНакопления.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.ОстаткиИОбороты(, , , , ДокументПланирования В (&Заявка)) КАК ПлПоступлениеДенежныхСредств";

	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СтрОплата.СуммаПлан    			= Выборка.СуммаПлан;
		СтрОплата.СуммаОплата    		= Выборка.СуммаФакт;
		СтрОплата.Разность 				= Выборка.СуммаОстаток;
		СтрОплата.СуммаДокументаПлан    = Выборка.СуммаПлан;
		СтрОплата.СуммаДокументаОплата  = Выборка.СуммаФакт;
		СтрОплата.СуммаДокументаРазность = Выборка.СуммаОстаток;
		
	КонецЕсли; 

	Возврат СтрОплата;
	
КонецФункции // ПолучитьОплатыПоПоступлению()

// Функция определяет новый статус объекта в зависимости от режима записи документа
//и предыдущего статуса. Механизм определения статусов может быть переопределен алгоритмами.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.
//  ПараметрыУстановкиСтатуса - Структура - состав полей см. в функции бит_ВизированиеСервер.НовыеПараметрыУстановкиСтатуса.
//
// Возвращаемое значение:
//   НовыйСтатус - СправочникСсылка.бит_СтатусыОбъектов.
//
Функция НовыйСтатусОбъекта(ТекущийОбъект, ПараметрыУстановкиСтатуса) Экспорт
	
	Если ПараметрыУстановкиСтатуса.ПараметрыОплаты = Неопределено Тогда
		СтруктураОплаты = Документы.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.ПолучитьОстаток(ТекущийОбъект.Ссылка);
	Иначе
		СтруктураОплаты = ПараметрыУстановкиСтатуса.ПараметрыОплаты;
	КонецЕсли;
	
	Если СтруктураОплаты.Остаток <= 0.01 И СтруктураОплаты.Факт > 0 Тогда
		Возврат Справочники.бит_СтатусыОбъектов.Оплачен;
	ИначеЕсли СтруктураОплаты.Факт > 0 Тогда
		Возврат Справочники.бит_СтатусыОбъектов.ЧастичноОплачен;
	КонецЕсли;
	
	Возврат бит_ВизированиеСервер.НовыйСтатусПоСтандартномуАлгоритму(ТекущийОбъект, ПараметрыУстановкиСтатуса);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция получает неоплаченный остаток по планируемому поступлению.
//
// Параметры:
//   Позиция - ДокументСсылка.бит_кзн_ПланируемоеПоступлениеДенежныхСредств
//
// Возвращаемое значение:
//  СтрОплата - Структура.
//
Функция ПолучитьОстаток(ДокументПланирования) Экспорт

	СтрОплата = Новый Структура("План, Факт, Остаток",0, 0, 0);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидПлана"            , ДокументПланирования.ВидПлана);
	Запрос.УстановитьПараметр("ДокументПланирования", ДокументПланирования);
	Запрос.УстановитьПараметр("Организация"         , ДокументПланирования.Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ОстаткиПланируемыхПоступлений.СуммаКонечныйОстаток, 0) КАК СуммаОстаток,
	|	ЕСТЬNULL(ОстаткиПланируемыхПоступлений.СуммаПриход, 0) КАК СуммаПлан,
	|	ЕСТЬNULL(ОстаткиПланируемыхПоступлений.СуммаРасход, 0) КАК СуммаФакт
	|ИЗ
	|	РегистрНакопления.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.ОстаткиИОбороты(
	|			,
	|			,
	|			,
	|			,
	|			ВидПлана = &ВидПлана
	|				И ДокументПланирования = &ДокументПланирования
	|				И Организация = &Организация) КАК ОстаткиПланируемыхПоступлений";

	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СтрОплата.План    = Выборка.СуммаПлан;
		СтрОплата.Факт    = Выборка.СуммаФакт;
		СтрОплата.Остаток = Выборка.СуммаОстаток;
	
	КонецЕсли; 

	Возврат СтрОплата;
	
КонецФункции // ПолучитьОстаток()

Процедура ОпределитьСтатьюДДС(ДанныеЗаполнения, РеквизитыПозиции, ВидОперации)

	ДоговорКонтрагента = РеквизитыПозиции.ДоговорКонтрагента;
	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		СтатьяДДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорКонтрагента, "СтатьяДвиженияДенежныхСредств");
		Если ЗначениеЗаполнено(СтатьяДДС) Тогда
			ДанныеЗаполнения.СтатьяДвиженияДенежныхСредств = СтатьяДДС;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СтатьяОборотов = РеквизитыПозиции.СтатьяОборотов;
	Если ЗначениеЗаполнено(СтатьяОборотов) Тогда
		СтатьяДДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтатьяОборотов, "ОсновнаяСтатьяДДС");
		Если ЗначениеЗаполнено(СтатьяДДС) Тогда
			ДанныеЗаполнения.СтатьяДвиженияДенежныхСредств = СтатьяДДС;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СтатьиДДС = РегистрыСведений.бит_СоответствияАналитик.ПолучитьЛевуюАналитику(
						ПредопределенноеЗначение("Справочник.бит_ВидыСоответствийАналитик.СтатьиДДС_СтатьиОборотов"),
						СтатьяОборотов, ТекущаяДатаСеанса());

	Если ЗначениеЗаполнено(СтатьиДДС) Тогда
		ДанныеЗаполнения.СтатьяДвиженияДенежныхСредств = СтатьиДДС[0];
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения.СтатьяДвиженияДенежныхСредств) Тогда
		Кандидат = Справочники.СтатьиДвиженияДенежныхСредств.СтатьяДвиженияДенежныхСредствПоХозяйственнойОперации(ВидОперации);
		
		Если ЗначениеЗаполнено(Кандидат) Тогда
			ДанныеЗаполнения.СтатьяДвиженияДенежныхСредств = Кандидат;
		КонецЕсли;	
	КонецЕсли; 

КонецПроцедуры

Функция ЗначениеРеквизитовПозиции(Позиция)
	
	Если ТипЗнч(Позиция) = Тип("Структура") Тогда
		ДокументПозиции = Позиция.Позиция;
	Иначе
		ДокументПозиции = Позиция;
	КонецЕсли;
	
	РеквизитыПозиции = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументПозиции, "СтатьяОборотов, ЦФО, ОбъектРасчетов");
	
	ОбъектРасчетов = РеквизитыПозиции.ОбъектРасчетов;
	
	ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	Если ТипЗнч(ОбъектРасчетов) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		ДоговорКонтрагента = ОбъектРасчетов;
	ИначеЕсли ЗначениеЗаполнено(ОбъектРасчетов) Тогда
		МетаданныеОбъектаРасчетов = ОбъектРасчетов.Метаданные();
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ДоговорКонтрагента", МетаданныеОбъектаРасчетов) Тогда
			ДоговорКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектРасчетов, "ДоговорКонтрагента");
		ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("Договор", МетаданныеОбъектаРасчетов) Тогда
			ДоговорКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектРасчетов, "Договор");
		КонецЕсли;
	КонецЕсли;
	РеквизитыПозиции.Вставить("ДоговорКонтрагента", ДоговорКонтрагента);
	
	Возврат РеквизитыПозиции;
	
КонецФункции

Процедура ОпределитьПодразделение(ДанныеЗаполнения, Позиция)

	Подразделение = Документы.бит_кзн_ПлатежнаяПозиция.ПодразделениеДополнительныеИзмерения(Позиция);
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ДанныеЗаполнения.Подразделение = Подразделение;
		Возврат;
	КонецЕсли;
	
	СтатьиДДС = РегистрыСведений.бит_СоответствияАналитик.ПолучитьЛевуюАналитику(
						ПредопределенноеЗначение("Справочник.бит_ВидыСоответствийАналитик.СтруктураПредприятия_ЦФО"), 
						Позиция.ЦФО, ТекущаяДатаСеанса());
																
	Если ЗначениеЗаполнено(СтатьиДДС) Тогда
		ДанныеЗаполнения.Подразделение = СтатьиДДС[0];
	КонецЕсли;
		
КонецПроцедуры

Функция ЧастиТекстаНазначениеПлатежа(НазначениеПлатежа)
	
	ТекстНазначение = "";
	ТекстСуммы		= "";
	
	Если НЕ ПустаяСтрока(НазначениеПлатежа) Тогда
		// Решено для экспремента отказаться от поиска слова "сумма" потому, что
		// назначение платежа, введенное руками начинают с этого слова.
		// ПозицияСумма = СтрНайти(НазначениеПлатежа, "Сумма");
		ПозицияСумма = 0;
		
		Если ПозицияСумма = 0 Тогда // для совместимости, при редактировании старых платежек
			ПозицияСумма = СтрНайти(НазначениеПлатежа, "В т.ч. НДС");
			Если ПозицияСумма = 0 Тогда
				ПозицияСумма = СтрНайти(НазначениеПлатежа, "Без налога (НДС)");
			КонецЕсли;
			Если ПозицияСумма = 0 Тогда
				ПозицияСумма = СтрНайти(НазначениеПлатежа, "НДС не облагается");
			КонецЕсли;
		КонецЕсли;
		
		ТекстНазначение = ?(ПозицияСумма = 0, НазначениеПлатежа, Лев(НазначениеПлатежа, ПозицияСумма - 1));
		Если Прав(ТекстНазначение, 1) = Символы.ПС Тогда
			ТекстНазначение = Лев(ТекстНазначение, СтрДлина(ТекстНазначение) - 1);
		КонецЕсли;
		ТекстСуммы = СтрЗаменить(НазначениеПлатежа, ТекстНазначение, "");
		Если Лев(ТекстСуммы, 1) = Символы.ПС Тогда
			ТекстСуммы = Сред(ТекстСуммы, 2);
		КонецЕсли;
	КонецЕсли;

	ЧастиТекста = Новый Структура; 
	ЧастиТекста.Вставить("Назначение", ТекстНазначение);
	ЧастиТекста.Вставить("Суммы", ТекстСуммы);
	
	Возврат ЧастиТекста;

КонецФункции

Функция РасчитатьСуммуНДС(Сумма, СтавкаНДС)

	ЗначениеСтавки = бит_БухгалтерскийУчет.ПолучитьСтавкуНДС(СтавкаНДС);
	СуммаНДС 	   = бит_БухгалтерияКлиентСервер.РассчитатьСуммуНДС(Сумма,
							Истина, Истина, ЗначениеСтавки);
	Возврат СуммаНДС;
	
КонецФункции
																	
#КонецОбласти

#КонецЕсли
